RT-Thread/rt-thread/bsp/gd32/arm/libraries/GD32E50x_Firmware_Library/GD32E50x_standard_peripheral/Source/gd32e50x_adc.c
/*!
    \brief      get the ADC flag
    \param[in]  adc_periph: ADCx, x=0,1,2
    \param[in]  flag: the ADC flag bits
                only one parameter can be selected which is shown as below:
      \arg        ADC_FLAG_WDE0: analog watchdog 0 event flag
      \arg        ADC_FLAG_EOC: end of group conversion flag
      \arg        ADC_FLAG_EOIC: end of inserted group conversion flag
      \arg        ADC_FLAG_STIC: start flag of inserted channel group
      \arg        ADC_FLAG_STRC: start flag of regular channel group
      \arg        ADC_FLAG_WDE1: analog watchdog 1 event flag
      \arg        ADC_FLAG_WDE2: analog watchdog 2 event flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus adc_flag_get(uint32_t adc_periph, uint32_t flag)
{
    FlagStatus reval = RESET;
    if(ADC_STAT(adc_periph) & flag)
    {
        reval = SET;
    }
    return reval;
}

/*!
    \brief      clear the ADC flag
    \param[in]  adc_periph: ADCx, x=0,1,2
    \param[in]  flag: the ADC flag
                one or more parameters can be selected which is shown as below:
      \arg        ADC_FLAG_WDE0: analog watchdog 0 event flag
      \arg        ADC_FLAG_EOC: end of group conversion flag
      \arg        ADC_FLAG_EOIC: end of inserted group conversion flag
      \arg        ADC_FLAG_STIC: start flag of inserted channel group
      \arg        ADC_FLAG_STRC: start flag of regular channel group
      \arg        ADC_FLAG_WDE1: analog watchdog 1 event flag
      \arg        ADC_FLAG_WDE2: analog watchdog 2 event flag
    \param[out] none
    \retval     none
*/
void adc_flag_clear(uint32_t adc_periph , uint32_t flag)
{
    ADC_STAT(adc_periph) &= ~((uint32_t)flag);
}

/*!
    \brief      enable ADC interrupt
    \param[in]  adc_periph: ADCx, x=0,1,2
    \param[in]  interrupt: the ADC interrupt
                one or more parameters can be selected which is shown as below:
      \arg        ADC_INT_WDE0: analog watchdog 0 interrupt flag
      \arg        ADC_INT_EOC: end of group conversion interrupt flag
      \arg        ADC_INT_EOIC: end of inserted group conversion interrupt flag
      \arg        ADC_INT_WDE1: analog watchdog 1 interrupt flag
      \arg        ADC_INT_WDE2: analog watchdog 2 interrupt flag
    \param[out] none
    \retval     none
*/
void adc_interrupt_enable(uint32_t adc_periph , uint32_t interrupt)
{
    switch(interrupt)
    {
    /* enable analog watchdog 0 interrupt */
    case ADC_INT_WDE0:
        ADC_CTL0(adc_periph) |= (uint32_t)ADC_CTL0_WDE0IE;
        break;
    /* enable end of group conversion interrupt */
    case ADC_INT_EOC:
        ADC_CTL0(adc_periph) |= (uint32_t)ADC_CTL0_EOCIE;
        break;
    /* enable end of inserted group conversion interrupt */
    case ADC_INT_EOIC:
        ADC_CTL0(adc_periph) |= (uint32_t)ADC_CTL0_EOICIE;
        break;
    /* enable analog watchdog 1 interrupt */
    case ADC_INT_WDE1:
        ADC_CTL0(adc_periph) |= (uint32_t)ADC_CTL0_WDE1IE;
        break;
    /* enable analog watchdog 2 interrupt */
    case ADC_INT_WDE2:
        ADC_CTL0(adc_periph) |= (uint32_t)ADC_CTL0_WDE2IE;
        break;
    default:
        break;
    }
}

/*!
    \brief      disable ADC interrupt
    \param[in]  adc_periph: ADCx, x=0,1,2
    \param[in]  interrupt: the ADC interrupt flag
                one or more parameters can be selected which is shown as below:
      \arg        ADC_INT_WDE0: analog watchdog 0 interrupt flag
      \arg        ADC_INT_EOC: end of group conversion interrupt flag
      \arg        ADC_INT_EOIC: end of inserted group conversion interrupt flag
      \arg        ADC_INT_WDE1: analog watchdog 1 interrupt flag
      \arg        ADC_INT_WDE2: analog watchdog 2 interrupt flag
    \param[out] none
    \retval     none
*/
void adc_interrupt_disable(uint32_t adc_periph, uint32_t interrupt)
{
    switch(interrupt)
    {
    /* disable analog watchdog 0 interrupt */
    case ADC_INT_WDE0:
        ADC_CTL0(adc_periph) &= ~(uint32_t)ADC_CTL0_WDE0IE;
        break;
    /* disable end of group conversion interrupt */
    case ADC_INT_EOC:
        ADC_CTL0(adc_periph) &= ~(uint32_t)ADC_CTL0_EOCIE;
        break;
    /* disable end of inserted group conversion interrupt */
    case ADC_INT_EOIC:
        ADC_CTL0(adc_periph) &= ~(uint32_t)ADC_CTL0_EOICIE;
        break;
    /* disable analog watchdog 1 interrupt */
    case ADC_INT_WDE1:
        ADC_CTL0(adc_periph) &= ~(uint32_t)ADC_CTL0_WDE1IE;
        break;
    /* disable analog watchdog 2 interrupt */
    case ADC_INT_WDE2:
        ADC_CTL0(adc_periph) &= ~(uint32_t)ADC_CTL0_WDE1IE;
        break;
    default:
        break;
    }
}

/*!
    \brief      get ADC interrupt flag
    \param[in]  adc_periph: ADCx, x=0,1,2
    \param[in]  int_flag: the ADC interrupt
                only one parameter can be selected which is shown as below:
      \arg        ADC_INT_FLAG_WDE0: analog watchdog 0 interrupt flag
      \arg        ADC_INT_FLAG_EOC: end of group conversion interrupt flag
      \arg        ADC_INT_FLAG_EOIC: end of inserted group conversion interrupt
      \arg        ADC_INT_FLAG_WDE1: analog watchdog 1 interrupt flag
      \arg        ADC_INT_FLAG_WDE2: analog watchdog 2 interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus adc_interrupt_flag_get(uint32_t adc_periph , uint32_t int_flag)
{
    FlagStatus interrupt_flag = RESET;
    uint32_t state;
    /* check the interrupt bits */
    switch(int_flag)
    {
    case ADC_INT_FLAG_WDE0:
        state = ADC_STAT(adc_periph) & ADC_STAT_WDE0;
        if((ADC_CTL0(adc_periph) & ADC_CTL0_WDE0IE) && state)
        {
          interrupt_flag = SET;
        }
        break;
    case ADC_INT_FLAG_EOC:
        state = ADC_STAT(adc_periph) & ADC_STAT_EOC;
          if((ADC_CTL0(adc_periph) & ADC_CTL0_EOCIE) && state)
          {
            interrupt_flag = SET;
          }
        break;
    case ADC_INT_FLAG_EOIC:
        state = ADC_STAT(adc_periph) & ADC_STAT_EOIC;
        if((ADC_CTL0(adc_periph) & ADC_CTL0_EOICIE) && state)
        {
            interrupt_flag = SET;
        }
        break;
        case ADC_INT_FLAG_WDE1:
        state = ADC_STAT(adc_periph) & ADC_STAT_WDE1;
        if((ADC_CTL0(adc_periph) & ADC_CTL0_WDE1IE) && state)
        {
          interrupt_flag = SET;
        }
        break;
       case ADC_INT_FLAG_WDE2:
        state = ADC_STAT(adc_periph) & ADC_STAT_WDE2;
        if((ADC_CTL0(adc_periph) & ADC_CTL0_WDE2IE) && state)
        {
          interrupt_flag = SET;
        }
        break;
    default:
        break;
    }
    return interrupt_flag;
}

/*!
    \brief      clear ADC interrupt flag
    \param[in]  adc_periph: ADCx, x=0,1,2
    \param[in]  int_flag: the ADC interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        ADC_INT_FLAG_WDE0: analog watchdog 0 interrupt flag
      \arg        ADC_INT_FLAG_EOC: end of group conversion interrupt flag
      \arg        ADC_INT_FLAG_EOIC: end of inserted group conversion interrupt flag
      \arg        ADC_INT_FLAG_WDE1: analog watchdog 1 interrupt flag
      \arg        ADC_INT_FLAG_WDE2: analog watchdog 2 interrupt flag
    \param[out] none
    \retval     none
*/
void adc_interrupt_flag_clear(uint32_t adc_periph, uint32_t int_flag)
{
    ADC_STAT(adc_periph) &= ~((uint32_t)int_flag);
}
